<?php
//настраиваю поведение языка на жесткую строгость
declare(strict_types=1);
//$searchRoot - откуда начинаем поиск и далее путь
//$searchName переменная
//$searchResult = [] переменная с пустым массивом чтобы было куда складывать пути
$searchRoot = __DIR__;
$searchName = 'test.txt';
$searchResult = [];


//объявляю функцию с именем поиска файла
//потом параметры откуда искать,что искать и куда складывать результат
//по ссылке (амперсанд) чтобы оригинал передать
//void чтобы ничего не возвращать
function findFile(string $searchRoot, string $searchName, array &$searchResult): void
{
    //через скандир возвращаю массив имен всех файлов и папок внутри
     $items = scandir($searchRoot);
//для каждого элемента массива items,называя его item выполняем то что в фигурных скобках
    foreach ($items as $item) {
        //если текущий элемент равен точке или две точки
        //то пропустить его и перейти к следующему
        if ($item === '.' || $item === '..') {
            continue;
        }
    //полный путь к элементу
    //$searchRoot путь к папке,где ищу.
    //DIRECTORY_SEPARATOR разделитель пути \
    //item имя текущего элемента
    //для чего полный путь: чтобы is_dir() и filesize() знала где лежит элемент
        $fullPath = $searchRoot . DIRECTORY_SEPARATOR . $item;
    //чтобы вернуть true если элемент папка и false если файл
    //потом рекурсия,в этот раз передаю по значению,т.к по ссылке уже зашито в функции выше
    // если предыдущее условие ложно то элемент не папка а файл
    //именно elseif чтобы отсечь все лишнее и попали только точные совпадения
    //$searchResult[] добавляю новый элемент в конец массива

        if (is_dir($fullPath)) {
            findFile($fullPath, $searchName, $searchResult);
        } elseif ($item === $searchName) {
            $searchResult[] = $fullPath;
        }
    }
}
//наконец вызов функции. а $searchResult уже готовенький заполненный файлами
findFile($searchRoot, $searchName, $searchResult);
//тут фильтрация,оставляю только те массивы где колбэк вернул true
//что фильтруем $searchResult
//потом callback. оставляю в массиве только те пути чьи файлы заполнены данными
//return filesize($path) > 0 беру размер файла через filesize(). если больше 0 то true

$searchResult = array_filter($searchResult, 'filesize');
//count($searchResult) сколько элементов в массиве "=== 0 " строго равно нулю
//если в массиве ничего нет то..
//если пусто то скажи,что результат нулевой
if (count($searchResult) === 0) {
    echo "Ничего не найдено\n";
} else {
    //прохожусь по каждому элементу массива $searchResult и path один найденный путь
    foreach ($searchResult as $path) {
        //в итоге печатаем путь с аккуратным списком
        echo $path . "\n";
    }
}


//итого: задала три переменные: где искать,что искать и куда складывать
//Описала функцию findFile ,которая читает содержимоке через скандир,игнорирует точки,для каждой папки вызывает себя рекурсивно,для каждого файла сверяет имя,если совпало то добавляет путь в массив
// вызвала функцию один раз. поиск пошел по всему дереву
//потом фильтр ,оставила только один с текстом внутри файла
//вывод результата на экран